def scrabble(word):
    """Игра 'Эрудит'
    :param word: слово
    :return: количество очков за слово
    """
    points_all = {'а': 1, 'в': 1, 'е': 1, 'ё': 1, 'и': 1, 'н': 1, 'о': 1, 'р': 1, 'с': 1, 'т': 1,
                  'д': 2, 'к': 2, 'л': 2, 'м': 2, 'п': 2, 'у': 2,
                  'б': 3, 'г': 3, 'ь': 3, 'я': 3,
                  'й': 4, 'ы': 4,
                  'ж': 5, 'з': 5, 'х': 5, 'ц': 5, 'ч': 5,
                  'ф': 8, 'ш': 8, 'э': 8, 'ю': 8,
                  'щ': 10, 'ъ': 15}
    points = 0
    summa = ''
    for i in list(word):
        points += points_all.get(i, 0)
        summa += i + '=' + str(points_all.get(i, 0))
    return points
